Model: "sequential"
_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
conv2d (Conv2D)              (None, 224, 224, 128)     3584      
_________________________________________________________________
batch_normalization (BatchNo (None, 224, 224, 128)     512       
_________________________________________________________________
activation (Activation)      (None, 224, 224, 128)     0         
_________________________________________________________________
conv2d_1 (Conv2D)            (None, 224, 224, 64)      8256      
_________________________________________________________________
conv2d_2 (Conv2D)            (None, 224, 224, 32)      2080      
_________________________________________________________________
batch_normalization_1 (Batch (None, 224, 224, 32)      128       
_________________________________________________________________
activation_1 (Activation)    (None, 224, 224, 32)      0         
_________________________________________________________________
max_pooling2d (MaxPooling2D) (None, 112, 112, 32)      0         
_________________________________________________________________
conv2d_3 (Conv2D)            (None, 112, 112, 256)     73984     
_________________________________________________________________
batch_normalization_2 (Batch (None, 112, 112, 256)     1024      
_________________________________________________________________
activation_2 (Activation)    (None, 112, 112, 256)     0         
_________________________________________________________________
conv2d_4 (Conv2D)            (None, 112, 112, 128)     32896     
_________________________________________________________________
conv2d_5 (Conv2D)            (None, 112, 112, 64)      8256      
_________________________________________________________________
batch_normalization_3 (Batch (None, 112, 112, 64)      256       
_________________________________________________________________
activation_3 (Activation)    (None, 112, 112, 64)      0         
_________________________________________________________________
max_pooling2d_1 (MaxPooling2 (None, 56, 56, 64)        0         
_________________________________________________________________
conv2d_6 (Conv2D)            (None, 56, 56, 512)       295424    
_________________________________________________________________
batch_normalization_4 (Batch (None, 56, 56, 512)       2048      
_________________________________________________________________
activation_4 (Activation)    (None, 56, 56, 512)       0         
_________________________________________________________________
conv2d_7 (Conv2D)            (None, 56, 56, 256)       131328    
_________________________________________________________________
conv2d_8 (Conv2D)            (None, 56, 56, 128)       32896     
_________________________________________________________________
batch_normalization_5 (Batch (None, 56, 56, 128)       512       
_________________________________________________________________
activation_5 (Activation)    (None, 56, 56, 128)       0         
_________________________________________________________________
max_pooling2d_2 (MaxPooling2 (None, 28, 28, 128)       0         
_________________________________________________________________
conv2d_9 (Conv2D)            (None, 28, 28, 1024)      1180672   
_________________________________________________________________
batch_normalization_6 (Batch (None, 28, 28, 1024)      4096      
_________________________________________________________________
activation_6 (Activation)    (None, 28, 28, 1024)      0         
_________________________________________________________________
global_average_pooling2d (Gl (None, 1024)              0         
_________________________________________________________________
dropout (Dropout)            (None, 1024)              0         
_________________________________________________________________
dense (Dense)                (None, 6)                 6150      
=================================================================
Total params: 1,784,102
Trainable params: 1,779,814
Non-trainable params: 4,288
_________________________________________________________________
